tutorials/poiseuille flow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0 -0.0005 0)
    (0.02 -0.0005 0)
    (0.02 0.0005 0)
    (0 0.0005 0)
    (0 -0.0005 0.001)
    (0.02 -0.0005 0.001)
    (0.02 0.0005 0.001)
    (0 0.0005 0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 50 12) simpleGrading (1 1 1)
    
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    inlet
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
     }
     outlet
     {
        type wall;
        faces
        (
            (2 6 5 1)
        );
     }
    frontAndBack
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
